## `terraform/main`
#### Terraform Format and Style 🖌`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform
data.aws_caller_identity.current: Reading...
module.ecr.aws_ecr_repository.repos: Refreshing state... [id=lambda-sample-ecr]
data.aws_caller_identity.current: Read complete after 1s [id=761624429622]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ecr.aws_ecr_repository.repos has changed
  ~ resource "aws_ecr_repository" "repos" {
        id                   = "lambda-sample-ecr"
        name                 = "lambda-sample-ecr"
      + tags                 = {}
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-sample-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "owner"     = "okmtdev"
          + "service"   = "lambda-sample"
          + "terraform" = "true"
        }
      + unique_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>